Repository: xypine/bolt_core
Catalog: translations/security.*.xlf
Languages: fi

source: An authentication exception occurred.
fi: Käyttäjätodennuksessa tapahtui virhe

source: Authentication credentials could not be found.
fi: Tunnistautumistietoja ei löytynyt.

source: Authentication request could not be processed due to a system problem.
fi: Tunnistuspyyntöä ei voitu käsitellä järjestelmäongelman vuoksi.

source: Invalid credentials.
fi: Virheelliset tunnistetiedot.

source: Cookie has already been used by someone else.
fi: Joku muu on jo käyttänyt evästettä.

source: Not privileged to request the resource.
fi: Ei oikeutta pyytää resurssia.

source: Invalid CSRF token.
fi: Virheellinen CSRF-tunniste.

source: No authentication provider found to support the authentication token.
fi: Todentamistunnistetta tukevaa todentamispalveluntarjoajaa ei löytynyt.

source: No session available, it either timed out or cookies are not enabled.
fi: Ei käytettävissä olevaa istuntoa, se on joko päättynyt tai evästeet eivät ole käytössä.

source: No token could be found.
fi: Tunnistetta ei löytynyt.

source: Username could not be found.
fi: Käyttäjänimeä ei löytynyt.

source: Account has expired.
fi: Käyttäjätili on vanhentunut.

source: Credentials have expired.
fi: Tunnistetiedot ovat vanhentuneet.

source: Account is disabled.
fi: Tili on poistettu käytöstä.

source: Account is locked.
fi: Tili on lukittu.

source: User is disabled.
fi: Käyttäjä on poistettu käytöstä.

source: You have to login in order to access this page.
fi: Sinun on kirjauduttava sisään päästäksesi tälle sivulle.
