Repository: xypine/bolt_core
Catalog: translations/validators.*.xlf
Languages: fi

source: This value should be false.
fi: Tämän arvon tulisi olla epätosi.

source: This value should be true.
fi: Tämän arvon tulisi olla tosi.

source: This value should be of type {{ type }}.
fi: Tämän arvon tulisi olla tyyppiä {{ type }}.

source: This value should be blank.
fi: Tämän arvon tulisi olla tyhjä.

source: The value you selected is not a valid choice.
fi: Valitsemasi arvo ei ole mahdollinen vaihtoehto.

source: 0d999f2
fi: Sinun on valittava vähintään {{ limit }} valinta.|Sinun on valittava vähintään {{ limit }} valintoja.

source: One or more of the given values is invalid.
fi: Yksi tai useampi valitsemistasi arvoista on virheellinen.

source: This field was not expected.
fi: Tätä kenttää ei odotettu.

source: This field is missing.
fi: Tämä kenttä puuttuu.

source: This value is not a valid date.
fi: Tämä arvo ei ole kelvollinen päivämäärä.

source: This value is not a valid datetime.
fi: Tämä arvo ei ole kelvollinen päiväys.

source: This value is not a valid email address.
fi: Tämä arvo ei ole kelvollinen sähköpostiosoite.

source: The file could not be found.
fi: Tiedostoa ei löytynyt.

source: The file is not readable.
fi: Tiedosto ei ole luettavissa.

source: 1ad411a
fi: Tiedosto on liian suuri ({{ size }} {{ suffix }}). Sallittu enimmäiskoko on {{ limit }} {{ suffix }}.

source: 30a318d
fi: Tiedoston mime-tyyppi on virheellinen ({{ type }}). Sallitut mime-tyypit ovat {{ types }}.

source: This value should be {{ limit }} or less.
fi: Tämän arvon tulisi olla {{ limit }} tai pienempi.

source: 0e0c1e1
fi: Tämä arvo on liian pitkä. Sen pitäisi olla {{ limit }} merkki tai vähemmän.|Tämä arvo on liian pitkä. Sen pitäisi olla {{ limit }} merkkiä tai vähemmän.

source: This value should be {{ limit }} or more.
fi: Tämän arvon tulisi olla vähintään {{ limit }}.

source: 5188ff9
fi: Tämä arvo on liian lyhyt. Sen pitäisi olla {{ limit }} merkki tai enemmän.|Tämä arvo on liian lyhyt. Sen pitäisi olla {{ limit }} merkkiä tai enemmän.

source: This value should not be blank.
fi: Tämä arvo ei saa olla tyhjä.

source: This value should not be null.
fi: Tämä arvo ei saa olla tyhjä.

source: This value should be null.
fi: Tämän arvon pitäisi olla tyhjä.

source: This value is not valid.
fi: Tämä arvo on virheellinen.

source: This value is not a valid time.
fi: Tämä arvo ei ole kelvollinen aika.

source: This value is not a valid URL.
fi: Tämä arvo ei ole kelvollinen URL-osoite.

source: The two values should be equal.
fi: Näiden kahden arvon pitäisi olla samat.

source: The file is too large. Allowed maximum size is {{ limit }} {{ suffix }}.
fi: Tiedosto on liian suuri. Sallittu enimmäiskoko on {{ limit }} {{ suffix }}.

source: The file is too large.
fi: Tiedosto on liian suuri.

source: The file could not be uploaded.
fi: Tiedostoa ei voitu lähettää.

source: This value should be a valid number.
fi: Tämän arvon on oltava kelvollinen numero.

source: This file is not a valid image.
fi: Tämä tiedosto ei ole kelvollinen kuva.

source: This is not a valid IP address.
fi: Tämä ei ole kelvollinen IP-osoite.

source: This value is not a valid language.
fi: Tämä arvo ei ole kelvollinen kieli.

source: This value is not a valid locale.
fi: Tämä arvo ei ole kelvollinen alue.

source: This value is not a valid country.
fi: Tämä arvo ei ole kelvollinen maa.

source: This value is already used.
fi: Tämä arvo on jo käytössä.

source: The size of the image could not be detected.
fi: Kuvan kokoa ei voitu tunnistaa.

source: 266051e
fi: Kuvan leveys on liian suuri ({{ width }}px). Sallittu enimmäisleveys on {{ max_width }}px.

source: c1c23f9
fi: Kuvan leveys on liian pieni ({{ width }}px). Pienin sallittu leveys on {{ min_width }}px.

source: 9a128f7
fi: Kuvan korkeus on liian suuri ({{ height }}px). Sallittu enimmäiskorkeus on {{ max_height }}px.

source: 8a4cd70
fi: Kuvan korkeus on liian pieni ({{ height }}px). Pienin sallittu korkeus on {{ min_height }}px.

source: This value should be the user's current password.
fi: Tämän arvon pitäisi olla käyttäjän nykyinen salasana.

source: fd389d6
fi: Tässä arvossa tulee olla täsmälleen {{ limit }} merkki.|Tässä arvossa tulee olla täsmälleen {{ limit }} merkkiä.

source: The file was only partially uploaded.
fi: Tiedosto lähetettiin vain osittain.

source: No file was uploaded.
fi: Tiedostoa ei ole lähetetty.

source: No temporary folder was configured in php.ini.
fi: php.ini-tiedostossa ei määritetty väliaikaista kansiota tai määritettyä kansiota ei ole olemassa.

source: Cannot write temporary file to disk.
fi: Väliaikaistiedostoa ei voi kirjoittaa levylle.

source: A PHP extension caused the upload to fail.
fi: PHP-laajennus aiheutti latauksen epäonnistumisen.

source: b54c218
fi: Tämän kokoelman tulisi sisältää vähintään {{ limit }} elementin.|Tämän kokoelman tulisi sisältää vähintään {{ limit }} elementtiä.

source: 949632c
fi: Tämän kokoelman tulisi sisältää {{ limit }} elementin tai vähemmän.|Tämän kokoelman tulisi sisältää {{ limit }} elementtiä tai vähemmän.

source: e0582dc
fi: Tämän kokoelman tulisi sisältää täsmälleen {{ limit }} elementin.|Tämän kokoelman tulisi sisältää täsmälleen {{ limit }} elementtiä.

source: Invalid card number.
fi: Virheellinen kortin numero.

source: Unsupported card type or invalid card number.
fi: Tukematon korttityyppi tai virheellinen kortin numero.

source: This is not a valid International Bank Account Number (IBAN).
fi: Tämä ei ole kelvollinen kansainvälinen tilinumero (IBAN).

source: This value is not a valid ISBN-10.
fi: Tämä arvo ei ole kelvollinen ISBN-10.

source: This value is not a valid ISBN-13.
fi: Tämä arvo ei ole kelvollinen ISBN-13.

source: This value is neither a valid ISBN-10 nor a valid ISBN-13.
fi: Tämä arvo ei ole kelvollinen ISBN-10 eikä kelvollinen ISBN-13.

source: This value is not a valid ISSN.
fi: Tämä arvo ei ole kelvollinen ISSN.

source: This value is not a valid currency.
fi: Tämä arvo ei ole kelvollinen valuutta.

source: This value should be equal to {{ compared_value }}.
fi: Tämän arvon pitäisi olla sama kuin {{ compared_value }}.

source: This value should be greater than {{ compared_value }}.
fi: Tämän arvon tulisi olla suurempi kuin {{ compared_value }}.

source: This value should be greater than or equal to {{ compared_value }}.
fi: Tämän arvon on oltava suurempi tai yhtä suuri kuin {{ compared_value }}.

source: This value should be less than {{ compared_value }}.
fi: Tämän arvon tulisi olla pienempi kuin {{ compared_value }}.

source: This value should be less than or equal to {{ compared_value }}.
fi: Tämän arvon tulisi olla pienempi tai yhtä suuri kuin {{ compared_value }}.

source: This value should not be equal to {{ compared_value }}.
fi: Tämän arvon ei pitäisi olla yhtä suuri kuin {{ compared_value }}.

source: 0eedf91
fi: Tämän arvon ei pitäisi olla sama kuin {{ compared_value_type }} {{ compared_value }}.

source: 9c3ad0f
fi: Kuvasuhde on liian suuri ({{ ratio }}). Sallittu enimmäissuhde on {{ max_ratio }}.

source: 4376d45
fi: Kuvasuhde on liian pieni ({{ ratio }}). Pienin sallittu suhde on {{ min_ratio }}.

source: The image is square ({{ width }}x{{ height }}px). Square images are not allowed.
fi: Kuva on neliönmuotoinen ({{ width }}x{{ height }}px). Nelikulmaisia kuvia ei sallita.

source: 1dc128a
fi: Kuva on maisemasuuntainen ({{ width }}x{{ height }}px). Maisemasuuntaisia kuvia ei sallita.

source: 9e27714
fi: Kuva on muotokuvasuuntainen ({{ leveys }}x{{ korkeus }}px). Muotokuvasuuntaiset kuvat eivät ole sallittuja.

source: An empty file is not allowed.
fi: Tyhjä tiedosto ei ole sallittu.

source: The host could not be resolved.
fi: Verkkoisäntää ei saatu selville.

source: This value does not match the expected {{ charset }} charset.
fi: Tämä arvo ei vastaa odotettua {{ charset }} merkistöä.

source: This is not a valid Business Identifier Code (BIC).
fi: Tämä ei ole kelvollinen BIC-koodi (Business Identifier Code).

source: Error
fi: Virhe

source: This is not a valid UUID.
fi: Tämä ei ole kelvollinen UUID.

source: This value should be a multiple of {{ compared_value }}.
fi: Tämän arvon tulisi olla {{ compared_value }}:n kerrannainen.

source: This Business Identifier Code (BIC) is not associated with IBAN {{ iban }}.
fi: Tämä BIC-koodi (Business Identifier Code) ei liity IBAN:iin {{ iban }}.

source: This value should be valid JSON.
fi: Tämän arvon pitäisi olla kelvollista JSON -koodia.

source: This collection should contain only unique elements.
fi: Tämän kokoelman tulisi sisältää vain ainutlaatuisia elementtejä.

source: This value should be positive.
fi: Tämän arvon tulisi olla positiivinen.

source: This value should be either positive or zero.
fi: Tämän arvon on oltava joko positiivinen tai nolla.

source: This value should be negative.
fi: Tämän arvon pitäisi olla negatiivinen.

source: This value should be either negative or zero.
fi: Tämän arvon on oltava joko negatiivinen tai nolla.

source: This value is not a valid timezone.
fi: Tämä arvo ei ole kelvollinen aikavyöhyke.

source: 7e27e92
fi: Tämä salasana on vuotanut tietomurron yhteydessä, sitä ei saa käyttää. Käytä toista salasanaa.

source: This value should be between {{ min }} and {{ max }}.
fi: Tämän arvon tulisi olla {{ min }} ja {{ max }} välillä.

source: This form should not contain extra fields.
fi: Tämän lomakkeen ei pitäisi sisältää ylimääräisiä kenttiä.

source: The uploaded file was too large. Please try to upload a smaller file.
fi: Ladattu tiedosto oli liian suuri. Yritä ladata pienempi tiedosto.

source: The CSRF token is invalid. Please try to resubmit the form.
fi: CSRF-tunniste on virheellinen. Yritä lähettää lomake uudelleen.

source: post.blank_summary
fi: Anna postauksellesi tiivistelmä!

source: post.blank_content
fi: Postauksessasi pitäisi olla sisältöä!

source: post.too_short_content
fi: Postauksen sisältö on liian lyhyt (vähintään {{ limit }} merkkiä)

source: post.too_many_tags
fi: Liikaa tunnisteita (lisää {{ limit }} tunnistetta tai vähemmän)

source: comment.blank
fi: Älä jätä kommenttiasi tyhjäksi!

source: comment.too_short
fi: Kommentti on liian lyhyt (vähintään {{ limit }} merkkiä)

source: comment.too_long
fi: Kommentti on liian pitkä (enintään {{ limit }} merkkiä)

source: comment.is_spam
fi: Tämän kommentin sisältöä pidetään roskapostina.

source: user.duplicate_email
fi: Käyttäjä sähköpostiosoitteella {{ value }} on jo olemassa.

source: user.duplicate_username
fi: Käyttäjä käyttäjänimellä {{ value }} on jo olemassa.

source: user.not_valid_password
fi: Virheellinen salasana. Salasanan tulee olla vähintään 6 merkkiä pitkä.

source: user.not_valid_email
fi: Virheellinen sähköpostiosoite

source: user.username_invalid_characters
fi: Käyttäjätunnus saa sisältää vain pieniä latinalaisia kirjaimia, numeroita ja alaviivoja.

source: user.not_valid_display_name
fi: Virheellinen näyttönimi
